B3/myblog/app/controllers/categories_controller.rb

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
SELECT  `posts`.* FROM `posts` INNER JOIN `categories_posts` ON `posts`.`id` = `categories_posts`.`post_id` WHERE `categories_posts`.`category_id` = 1 LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `posts` INNER JOIN `categories_posts` ON `posts`.`id` = `categories_posts`.`post_id` WHERE `categories_posts`.`category_id` = 1
SELECT `categories`.* FROM `categories`
---
  def show_post_by_category
    category = Category.find(params[:id])
    @posts = category.posts.paginate(page: params[:page], per_page: 10)