B3/myblog/app/controllers/comments_controller.rb

  def index
    @comments = Comment.all.paginate(page: params[:page], per_page: 8)
---
SELECT  `comments`.* FROM `comments` LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM `comments`

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(comment_params)
    @comment.status = false
    if @comment.save
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 31 LIMIT 1
INSERT INTO `comments` (`post_id`, `content`, `email`, `status`, `created_at`, `updated_at`) VALUES (22, '萨达萨达的撒打算的撒', '1585754789@qq.com', 0, '2016-08-24 09:17:35', '2016-08-24 09:17:35')

  def update # 审核
    @post = Post.find(params[:post_id])
    @comment = set_comment
    @comment.status = true
    respond_to do |format|
      if @comment.save
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 22 LIMIT 1
UPDATE `comments` SET `status` = 1, `updated_at` = '2016-08-24 09:17:16' WHERE `comments`.`id` = 28

  def destroy
    @post = Post.find(params[:post_id])
    @comment.destroy
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 22 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 28

  def set_comment
    @comment = Comment.find(params[:id])
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 28 LIMIT 1