B3/myblog/app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate(page: params[:page], per_page: 10)
---
SELECT COUNT(*) FROM `posts`
SELECT `posts`.* FROM `posts`

  def search
    if params[:search].to_s == ''
      @posts = Post.paginate(page: params[:page], per_page: 10)
---
SELECT  `posts`.* FROM `posts` LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `posts`

  def show
    @comment = Comment.new
    @post = set_post
    @comments = @post.comments.paginate(page: params[:page], per_page: 5)
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`post_id` = 37 LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 30

  def create
    category = Category.find_by(title: params[:category].to_s)
    @post = category.posts.create(post_params)
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`title` = '编程' LIMIT 1
INSERT INTO `posts` (`title`, `content`, `created_at`, `updated_at`) VALUES ('a', 'dfghdsfghjhgfsaertghjkjhgdsdsa', '2016-08-24 08:37:50', '2016-08-24 08:37:50')

  def update
    if Category.find_by(title: params[:category].to_s).id == @post.categories[0].id # 重新编辑时分类是否改变
      respond_to do |format|
        if @post.update(post_params)
          format.html { redirect_to @post, notice: 'Post was successfully updated.' }
          format.json { render :show, status: :ok, location: @post }
        else
          format.html { render :edit }
          format.json { render json: @post.errors, status: :unprocessable_entity }
        end
      end
    else
      @post.destroy
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`title` = '编程' LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 18