B3/myblog/app/views/posts/_form.html.erb

SELECT `categories`.* FROM `categories`
---
          <select class="form-control" name="category">
            <% Category.all.each do |i| %>