B3/myblog/app/views/posts/index.html.erb

INSERT INTO `comments` (`post_id`, `content`, `email`, `created_at`, `updated_at`) VALUES (189, 'bfbpcqtxafvpchhjaduqqyjpsgfrbj', 'jingzf0214@gamil.com', '2016-08-25 12:49:27', '2016-08-25 12:49:27')
SELECT `categories`.* FROM `categories` INNER JOIN `categories_posts` ON `categories`.`id` = `categories_posts`.`category_id` WHERE `categories_posts`.`post_id` = 18
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 18
---
            <span>
              <small>发表于<%= post.created_at.strftime("%Y-%m-%d")%>|分类:<%= post.categories[0].title %>|评论数<%= post.comments.length%></small>