B3/myblog/app/views/posts/show.html.erb

    <div class="panel-heading">评论区
        <span class="badge pull-right"><%= @post.comments.count%></span>
---
SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 30
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 30